---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.IExternalServer
source: html/9894e27d-e9b9-df63-6751-182a501a280e.htm
---
# IExternalServer Methods

Implement this method to return a description of the server.